export const inputFields = [
    {
        key: 'n',
        desc: 'Кількість розбиття зони пластичної формозміни металу'
    },
    {
        key: 'Hp',
        desc: 'Товщина підкату, м'
    },
    {
        key: 'b',
        desc: 'Ширина смуги, м'
    },
    {
        key: 'R0',
        desc: 'Номінальний радіус робочих валків, м'
    },
    {
        key: 'ah',
        desc: 'Показник ступеню апроксимації контактних поверхонь'
    },
    {
        key: 'Sigmat0',
        desc: 'Вихідна межа текучості, МПа'
    },
    {
        key: 'e',
        desc: 'Допустима похибка при визначенні довжини зони випередження осередку деформації'
    },
    {
        key: 'h0',
        desc: 'Товщина смуги до пропуску, м'
    },
    {
        key: 'h1',
        desc: 'Товщина смуги після пропуску, м'
    },
    {
        key: 'Sigmamax',
        desc: 'Межа деформаційного зміцнення металу, що прокочується, МПа'
    },
    {
        key: 'a1',
        desc: '1-й емпіричний коефіціент, що залежить від хім. складу сталі'
    },
    {
        key: 'a2',
        desc: '2-й емпіричний коефіціент, що залежить від хім. складу сталі'
    },
    {
        key: 'a3',
        desc: '3-й емпіричний коефіціент, що залежить від хім. складу сталі'
    },
    {
        key: 'En',
        desc: 'Модуль Юнга материалу смуги, МПа'
    },
    {
        key: 'Eb',
        desc: 'Модуль Юнга материалу валків, МПа'
    },
    {
        key: 'wb',
        desc: 'Коефіцієнт Пуассона материалу валків'
    },
    {
        key: 'rm',
        desc: 'Густина деформуючого металу, МПа*(с/м)в кв.'
    },
    {
        key: 'f',
        desc: 'Середній коефіціент тертя'
    },
    {
        key: 'af',
        desc: 'Показник ступеню епюри коефіцієнта тертя'
    },
    {
        key: 'V1',
        desc: 'Швидкість виходу металу із осередку деформації, м/с'
    },
    {
        key: 'Sigma0',
        desc: 'Напруга заднього натягу, МПа'
    },
    {
        key: 'Sigma1',
        desc: 'Напруга переднього натягу, МПа'
    },
]

export const mainInputFields = [
    {
        key: 'n',
        desc: 'Кількість розбиття зони пластичної формозміни металу'
    },
    {
        key: 'Hp',
        desc: 'Товщина підкату, м'
    },
    {
        key: 'b',
        desc: 'Ширина смуги, м'
    },
    {
        key: 'h0',
        desc: 'Товщина смуги до пропуску, м'
    },
    {
        key: 'h1',
        desc: 'Товщина смуги після пропуску, м'
    },
    {
        key: 'f',
        desc: 'Середній коефіціент тертя'
    },
    {
        key: 'V1',
        desc: 'Швидкість виходу металу із осередку деформації, м/с'
    },
    {
        key: 'Sigma0',
        desc: 'Напруга заднього натягу, МПа'
    },
    {
        key: 'Sigma1',
        desc: 'Напруга переднього натягу, МПа'
    },
]

export const specialInputFields = [
    {
        key: 'R0',
        desc: 'Номінальний радіус робочих валків, м'
    },
    {
        key: 'ah',
        desc: 'Показник ступеню апроксимації контактних поверхонь'
    },
    {
        key: 'Sigmat0',
        desc: 'Вихідна межа текучості, МПа'
    },
    {
        key: 'e',
        desc: 'Допустима похибка при визначенні довжини зони випередження осередку деформації'
    },
    {
        key: 'Sigmamax',
        desc: 'Межа деформаційного зміцнення металу, що прокочується, МПа'
    },
    {
        key: 'a1',
        desc: '1-й емпіричний коефіціент, що залежить від хім. складу сталі'
    },
    {
        key: 'a2',
        desc: '2-й емпіричний коефіціент, що залежить від хім. складу сталі'
    },
    {
        key: 'a3',
        desc: '3-й емпіричний коефіціент, що залежить від хім. складу сталі'
    },
    {
        key: 'En',
        desc: 'Модуль Юнга материалу смуги, МПа'
    },
    {
        key: 'Eb',
        desc: 'Модуль Юнга материалу валків, МПа'
    },
    {
        key: 'wb',
        desc: 'Коефіцієнт Пуассона материалу валків'
    },
    {
        key: 'rm',
        desc: 'Густина деформуючого металу, МПа*(с/м)в кв.'
    },
    {
        key: 'af',
        desc: 'Показник ступеню епюри коефіцієнта тертя'
    },
]

export const outputFields = [
    {
        key: 'lenOfPlasticDef',
        desc: 'Довжина зони пластичної формозміни (із урахуванням пружної деформації робочих валків), мм'
    },
    {
        key: 'sumOfLenDef',
        desc: 'Сумарна довжина осередку деформації (із урахуванням пружного відновлення смуги), мм'
    },
    {
        key: 'anticipation',
        desc: 'Випередження, %'
    },
    {
        key: 'speedOfWorkingRolls',
        desc: 'Окружна (лінійна) швидкість робочих валків, МПа'
    },
    {
        key: 'mediumPressure',
        desc: 'Середній тиск металу на валки, МПа'
    },
    {
        key: 'rollingForce',
        desc: 'Сила прокатки, кН'
    },

    {
        key: 'rollingMoment',
        desc: 'Момент прокатки, кН*м'
    },
    {
        key: 'rollingCapacity',
        desc: 'Потужність прокатки, кВт'
    }
]



export const controlFields = [
    {
        key: 'setedVoltage',
        desc: 'Задана напруга переднього натягу, МПа'
    },
    {
        key: 'calculatedVoltage',
        desc: 'Розрахована напруга переднього натягу, МПа'
    },

    {
        key: 'percentageOfDiscrepancy',
        desc: 'Відсоток невідповідності заданої та розрахованої напруги преденього натягу, %'
    },
    {
        key: 'mistake',
        desc: 'Помилка, отримана при знаходженні довжини пружно деформованого контакту металу з валками, %'
    }
]