import oseredok_deformacii from '../../assets/oseredok_deformacii.png'
import zoma_formozminy from '../../assets/zoma_formozminy.png'
import img31 from '../../assets/3.1.png'
import img32 from '../../assets/3.2.png'
import img33 from '../../assets/3.3.png'
import img34 from '../../assets/3.4.png'
import img35 from '../../assets/3.5.png'
import img36 from '../../assets/3.6.png'
import img37 from '../../assets/3.7.png'
import img38 from '../../assets/3.8.png'
import img39 from '../../assets/3.9.png'
import img310 from '../../assets/3.10.png'
import img311 from '../../assets/3.11.png'
import img312 from '../../assets/3.12.png'
import img313 from '../../assets/3.13.png'

const MathModel = props => {

    return (
        <div className='math_model_wrapper'>
            <h1>Математична модель</h1>

            <div className='math_block'>
                <div className='schemas'>
                    <div>
                        <img src={oseredok_deformacii} alt="Розрахункові схеми інтегрального осередку деформації" width='500' height='400' />
                        <img src={zoma_formozminy} alt="Розрахункові схеми виділеного i-го елементарного обсягу зони пластичної формозміни" width='300' height='400' style={{ marginLeft: 100 }} />
                    </div>
                    <p className='schemas_desc'>
                        Розрахункові схеми інтегрального осередку деформації й виділеного i-го елементарного обсягу зони пластичної формозміни стосовно одномірного чисельного математичного моделювання напружено-деформованого стану металу при холодній тонколистовій прокатці
                    </p>
                </div>

                <div className='imgs'>
                    <img src={img31} alt='' width='600' height='80' />
                    <div>
                        <p>σxi1 і σxi2 – нормальні осьові напруги, що діють відповідно у початковому cd і кінцевому ае граничних перетинах (див. рис.1б) i-го елементарного обсягу зони пластичного формозміни (i=1…n);</p>
                        <p>hxi1 і hxi2 – значення товщини смуги відповідно в початковому і кінцевому граничних перетинах i-го елементарного обсягу;</p>
                        <p>xi1 та xi2 – геометричні координати відповідно початкового і кінцевого граничних перетинів i-го елементарного обсягу;</p>
                        <p>рxi1 і рxi2 – контактні нормальні напруги, що діють відповідно на початковому і кінцевому граничних перетинах i-го елементарного обсягу;</p>
                        <p>αxi – кут контакту металу з валками у межах i-го елементарного обсягу;</p>
                        <p>Δx=lпл/n – крок розбиття зони пластичної формозміни;</p>
                        <p>τxi1 і τxi2 – контактні дотичні напруження, що діють відповідно на початковому і кінцевому граничних перетинах i-го елементарного обсягу;</p>
                        <p>ρм – щільність деформованого металу;</p>
                        <p>Vxi1 і Vxi2 – швидкість руху деформованого металу відповідно в початковому і кінцевому граничних перетинах i-го елементарного обсягу.</p>
                    </div>

                    <img src={img32} alt='' width='240' height='34' />
                    <img src={img33} alt='' width='220' height='34' />
                    <div>
                        <p>V1 – швидкість виходу смуги із осередку деформації (швидкість прокатки);</p>
                        <p>Vв – окружна швидкість робочих валків;</p>
                        <p>hн – товщина смуги в нейтральному перетині осередку деформації.</p>
                    </div>

                    <img src={img34} alt='' width='190' height='38' />
                    <div>
                        <p>fс – коефіцієнт контактного тертя, що приймається на основі експериментальних даних робіт постійним по довжині зони пластичної формозміни металу.</p>
                    </div>

                    <img src={img35} alt='' width='210' height='38' />
                    <div>
                        <p>fxi1(2) – коефіцієнт контактного тертя, відповідний початковому або кінцевому граничному перетинах i-го елементарного обсягу зони пластичної формозміни осередку деформації.</p>
                    </div>

                    <img src={img36} alt='' width='370' height='50' />
                    <img src={img37} alt='' width='300' height='50' />
                    <div>
                        <p>f0от,  f0оп – опорні значення коефіцієнта тертя;</p>
                        <p>af – ступеневий показник</p>
                    </div>

                    <img src={img38} alt='' width='220' height='40' />
                    <div>
                        <p>h1 – товщина смуги після пропуску;</p>
                        <p>Δh=ho-h1 – абсолютне обтиснення смуги (ho – товщина смуги до пропуску);</p>
                        <p>х – геометрична координата, що змінюється від 0 до lпл;</p>
                        <p>ah – ступеневий показник апроксимації контактних поверхонь</p>
                    </div>

                    <img src={img39} alt='' width='700' height='40' />
                    <div>
                        <p>δh1 – пружне стиснення смуги в перерізі на виході її із зони пластичної формозміни;</p>
                        <p>x1 – геометрична координата перетину, що відповідає початку збільшення hx;</p>
                        <p>Wi1(2) – радіальне переміщення утворює поверхні робочих валків, яке визначається на основі рішення Штаєрмана і відповідне початковому або кінцевому граничному перерізу i-го елементарного обсягу осередку деформації;</p>
                        <p>φi1(2) – поточний кут контакту в осередку деформації, відповідний початковому або кінцевому граничним перетинам даного елементарного обсягу;</p>
                        <p>R - радіус валків;</p>
                    </div>

                    <img src={img310} alt='' width='220' height='34' />
                    <div>
                        <p>2kxi1(2) – подвоєне значення опору деформованого металу чистому зрушенню.</p>
                    </div>

                    <img src={img311} alt='' width='500' height='60' />
                    <div>
                        <p>σто – вихідна межа текучості деформованого металу;</p>
                        <p>а1,а2,а3 – емпіричні коефіцієнти;</p>
                        <p>εuxi1(2)=1,155*ln(ho/hxi1(2)) – значення інтенсивності деформації металу, відповідне початковому або кінцевому граничному перетину i-го елементарного обсягу зони пластичної формозміни;</p>
                    </div>

                    <img src={img312} alt='' width='500' height='70' />
                    <img src={img313} alt='' width='580' height='140' />
                    <div>
                        <p>2kо – початкове значення подвоєного опору деформованого матеріалу чистому зрушенню; σо – напруга заднього натягу.</p>
                    </div>

                </div>
            </div>
        </div>
    )
}

export default MathModel