import oseredok_deformacii from '../../assets/oseredok_deformacii.png'
import zoma_formozminy from '../../assets/zoma_formozminy.png'


const MathModel = props => {

    return (
        <div className='math_model_wrapper'>
            <h1>Математична модель</h1>

            <div>
                <p>
                    У зв'язку з інтенсивним розвитком обчислювальної техніки істотно зросло значення комп'ютерного моделювання для визначення найбільш ефективних технологічних режимів процесів пластичної деформації металів, в тому числі і процесу холодної тонколистової прокатки. При цьому широко використовуються різні математичні моделі, що відрізняються між собою характером прийнятих припущень, рівнем складності їх чисельної реалізації, а також об'ємом і ступенем достовірності отриманих результатів.
                </p>
                <p>
                    Визначення показників напружено-деформованого стану металу часто здійснюють за математичними моделями, отриманим на основі використання інженерних методів теорії пластичності. Незважаючи на відносну простоту, аналітичні рішення, характеризуються рядом недоліків, найбільш суттєвими з яких є упущення пружного відновленням смуги на виході з осередку деформації, надмірне спрощення реальної форми лінії контакту деформованого матеріалу з валками, а також усереднення коефіцієнта контактного тертя по всій довжині деформаційної зони.
                </p>
                <p>
                    Істотне збільшення ступеня достовірності одержуваної в результаті чисельного експерименту інформації може бути досягнуто на основі застосування методів кінцевих і граничних елементів. Разом з тим висока трудомісткість і значні витрати машинного часу на одну чисельну реалізацію обмежують використання цих методів.
                </p>
                <p>
                    У зв'язку з викладеним для розрахунку характеристик напружено-деформованого стану металу при холодній тонколистової прокатки обґрунтованим є застосування чисельних одновимірних математичних моделей різних рівнів складності. Зазначені математичні моделі базуються на організації численних рекурентних рішень кінцево-різницевих форм умов статико-динамічної (статичної) рівноваги або балансу енергетичних витрат, що розглядаються в рамках кожного окремо виділеного елементарного обсягу деформаційної зони валків. Разом з тим становить значний інтерес порівняльний аналіз чисельних одновимірних математичних моделей напружено-деформованого стану при холодній прокатці тонколистової сталі, що відповідають різним рівням складності.
                </p>
                <p>
                    В рамках даної роботи для визначення показників напруженого стану застосовується силовий підхід, що полягає у визначенні показників напружено-деформованого стану матеріалу шляхом реалізації чисельного рекурентного рішення кінцево-різницевої форми умови статико-динамічної рівноваги кожного окремо виділеного елементарного об'єму осередку деформації. Останній відповідно до представленої на рис. 1а схемою складається із зони пружного відновлення смуги на виході з валків Lуп і зони пластичної формозміни металу Lпл, що включає зони відставання Lот і випередження Lоп.
                </p>
                
                <div>

                <img src={oseredok_deformacii} alt="Розрахункові схеми інтегрального осередку деформації"/>
                <img src={zoma_formozminy} alt="Розрахункові схеми виділеного i-го елементарного обсягу зони пластичної формозміни"/>

                Розрахункові схеми інтегрального осередку деформації а й виділеного i-го елементарного обсягу зони пластичної формозміни б стосовно одномірного чисельного математичного моделювання напружено-деформованого стану металу при холодній тонколистовій прокатці
                </div>
               
                
            </div>
        </div>
    )
}

export default MathModel