
const Welcome = props => {

    return (
        <div className='welcome_wrapper'>
            <h1>Вітаю</h1>

            <h2>
                Дане прикладення слугує для розрахунку процессів холодної тонколистової прокатки та розроблене в рамках магістерської роботи студентом групи ВТ-19-М Поляком Іллєю.
            </h2>

            <div className='knowledge'>
                Пропоную ознайомитися із основними розділами програми:
                <ul>
                    <li>
                        <span>Сторінка "Головна"</span><span> - Вітаю Вас :)</span>
                    </li>
                    <li>
                        <span>Сторінка "Розрахунки"</span><span> - Проводьте розрахунки та досліджуйте процеси прокатки металу, зберігайте ваші розрахунки із коментарями</span>
                    </li>
                    <li>
                        <span>Сторінка "Історія"</span><span> - тут знаходяться ваші збережені розрахунки. Ви можете в будь-який час подивитися та скачати результати розрахунків</span></li>
                    <li>
                        <span>Сторінка "Математична модель"</span><span> - тут ви можете ознайомитися із математичною моделлю, що була покладена в основу даного прикладення та розглянути процес прокатки</span></li>
                    <li>
                        <span>Сторінка "Панель керування"</span><span> - якщо у вас є права адміністратора, то ви можете переглядати список користувачів та та збережені розрахунки</span></li>
                    <li>
                        <span>Кнопка "Вихід"</span><span> - для виходу із облікового запису</span>
                    </li>
                </ul>
            </div>

            <div className='nice'>
                Приємного користування :)
            </div>
            
        </div>
    )
}

export default Welcome